Base_1/src/Catalogs/ТЦСценарии/ТЦСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТЦСценарии</name>
  <attributes>
    <name>ДлительностьВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаузаПослеЗапускаВРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗагрузкиСценарияКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗаписиРезультатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапускаКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутИнициализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутОпросаКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПодготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Структура</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ТЦРоли</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ТЦПользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.ТЦКлиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Base_1/src/Catalogs/ТЦСценарии/Forms/Сценарий/Module.bsl
&НаКлиенте
Процедура АвтоТаймаутПодготовки(Команда)
	
	Максимум = МаксимумКлиентовНаКомпьютере();
	Объект.ТаймаутПодготовки =
		ТЦОбщий.ОкрВверх(Максимум / 10) * Объект.ТаймаутЗапускаКлиента + 60;
	
КонецПроцедуры // АвтоТаймаутПодготовки()

&НаСервере
// Определить максимальное количество клиентов, запускаемых на одном компьютере
//
// Параметры:
//  Сценарий
//
// Возвращаемое значение:
//  Число - максимальное количество клиентов
//
Функция МаксимумКлиентовНаКомпьютере()
	
	Компьютеры = Объект.Структура.Выгрузить(, "Клиент, Количество");
	Компьютеры.Колонки.Добавить("Компьютер");
	
	Для каждого СтрокаКомпьютера Из Компьютеры Цикл
		СтрокаКомпьютера.Компьютер = СтрокаКомпьютера.Клиент.Компьютер;
	КонецЦикла;
	
	Компьютеры.Свернуть("Компьютер", "Количество");
	Максимум = 0;
	
	Для каждого СтрокаКомпьютера Из Компьютеры Цикл
		Если СтрокаКомпьютера.Количество > Максимум Тогда
			Максимум = СтрокаКомпьютера.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Максимум;
	
КонецФункции // МаксимумКлиентовНаКомпьютере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ТекущийОбъект.ТаймаутЗапускаКлиента = 60;
		ТекущийОбъект.ТаймаутОпросаКлиента = 20;
		ТекущийОбъект.ТаймаутЗагрузкиСценарияКлиентом = 20;
		ТекущийОбъект.ТаймаутПодготовки = 120;
		ТекущийОбъект.ТаймаутИнициализации = 300;
		ТекущийОбъект.ТаймаутВыполнения = 900;
		ТекущийОбъект.ТаймаутЗаписиРезультатов = 300;
		ТекущийОбъект.ТаймаутУдаленияДанных = 300;
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКлиентПриИзменении(Элемент)
	
	Если ТЦСервер.ЭтоВебКлиент(Элементы.Структура.ТекущиеДанные.Клиент) Тогда
		Элементы.СтруктураКоличество.МаксимальноеЗначение = 1;
		Элементы.Структура.ТекущиеДанные.Количество = 1;
	Иначе
		Элементы.СтруктураКоличество.МаксимальноеЗначение = 1000000;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьВыполненияПриИзменении(Элемент)
	
	Если Объект.ДлительностьВыполнения > Объект.ТаймаутВыполнения Тогда
		Объект.ДлительностьВыполнения = Объект.ТаймаутВыполнения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРольОткрытие(Элемент, СтандартнаяОбработка)
	
	П = Новый Структура;
	П.Вставить("Ключ", Элементы.Структура.ТекущиеДанные.Роль);
	П.Вставить("ТЦСценарий", Объект.Ссылка);
	ОткрытьФорму("Справочник.ТЦРоли.Форма.Роль", П);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // СтруктураРольОткрытие()
